# PANDAS LIBRARY

In [2]:
import pandas as pd

In [3]:
#create pandas series
#Labels -Index by default starts with 0
a=["python","java","sql"]
se = pd.Series(a)
se

0    python
1      java
2       sql
dtype: object

In [4]:
#create pandas series with custom labels
a=["python","java","sql"]
se = pd.Series(a,index=['code1','code2','code3'])
se

code1    python
code2      java
code3       sql
dtype: object

In [5]:
#Create a Pandas Series from a dictionary
data = {"a":['p','y','t','h','o','n'],"b":['j','a','v','a']}
se = pd.Series(data)
se

a    [p, y, t, h, o, n]
b          [j, a, v, a]
dtype: object

In [6]:
#Create a Pandas Series from a dictionary with specific keys
data = {"a":['p','y','t','h','o','n'],"b":['j','a','v','a'],"c":['s','q','l']}
se = pd.Series(data, index=['a','c'])
se

a    [p, y, t, h, o, n]
c             [s, q, l]
dtype: object

In [7]:
#create a dataframe from two series
data = {"a":[5,4,3,2,1],"b":[10,9,8,7,6]}
df = pd.DataFrame(data)
df

   a   b
0  5  10
1  4   9
2  3   8
3  2   7
4  1   6

In [8]:
#specify the order of columns and define the index of the dataframe
df = pd.DataFrame({'program_id':[100, 101, 102], 'program':["python","java","sql"]},columns=['program_id','program'],index=['a','b','c'])
df

   program_id program
a         100  python
b         101    java
c         102     sql

In [9]:
# create a DataFrame from a list of lists 
pd.DataFrame([['a', 'car'], ['b', 'bike'], ['c', 'bus']], columns=['id', 'vehicle'])

  id vehicle
0  a     car
1  b    bike
2  c     bus

In [10]:
# create a NumPy array 
import numpy as np
arr = np.random.rand(6, 4)
arr

array([[0.28251633, 0.29782824, 0.67669601, 0.23312905],
       [0.34822212, 0.10001221, 0.61198578, 0.98041747],
       [0.66453187, 0.29810875, 0.24941197, 0.370899  ],
       [0.7953331 , 0.8138623 , 0.66377473, 0.55604575],
       [0.03966032, 0.00120103, 0.29801206, 0.29397467],
       [0.95510592, 0.39517249, 0.86300948, 0.03162084]])

In [11]:
# create a DataFrame from the NumPy array
pd.DataFrame(arr, columns=['one', 'two','three','four'])

        one       two     three      four
0  0.282516  0.297828  0.676696  0.233129
1  0.348222  0.100012  0.611986  0.980417
2  0.664532  0.298109  0.249412  0.370899
3  0.795333  0.813862  0.663775  0.556046
4  0.039660  0.001201  0.298012  0.293975
5  0.955106  0.395172  0.863009  0.031621

In [12]:
data = {"num1":[1,2,3],"num2":[4,5,6]}
df = pd.DataFrame(data)
df

   num1  num2
0     1     4
1     2     5
2     3     6

In [13]:
#loc attribute to return one or more specified rows- returns a series
df.loc[1]

num1    2
num2    5
Name: 1, dtype: int64

In [14]:
#return 0 and 1- returns a dataframe
df.loc[[1,2]]

   num1  num2
1     2     5
2     3     6

In [15]:
#use custom labels for dataframe
data = {"a":[1,2,3],"b":[4,5,6]}
df = pd.DataFrame(data,index=['list1','list2','list3'])
df

       a  b
list1  1  4
list2  2  5
list3  3  6

In [16]:
#Locate Named Indexes-returns series
df.loc['list2']

a    2
b    5
Name: list2, dtype: int64

In [17]:
#Locate Named Indexes-returns datadrame
df.loc[['list1','list3']]

       a  b
list1  1  4
list3  3  6

# LOAD FILES INTO DATAFRAMES USING PANDAS

In [18]:
#Read from url
url = 'https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv'
pd.read_csv(url)

       Country         Region
0      Algeria         AFRICA
1       Angola         AFRICA
2        Benin         AFRICA
3     Botswana         AFRICA
4      Burkina         AFRICA
..         ...            ...
189   Paraguay  SOUTH AMERICA
190       Peru  SOUTH AMERICA
191   Suriname  SOUTH AMERICA
192    Uruguay  SOUTH AMERICA
193  Venezuela  SOUTH AMERICA

[194 rows x 2 columns]